Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 226, 226, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 112, 112, 24)      648       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 112, 112, 24)      96        
_________________________________________________________________
conv1_relu (ReLU)            (None, 112, 112, 24)      0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 24)      216       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 112, 112, 24)      96        
_________________________________________________________________
conv_dw_1_relu (ReLU)        (None, 112, 112, 24)      0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 112, 112, 48)      1152      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 112, 112, 48)      192       
_________________________________________________________________
conv_pw_1_relu (ReLU)        (None, 112, 112, 48)      0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 114, 114, 48)      0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 48)        432       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 56, 56, 48)        192       
_________________________________________________________________
conv_dw_2_relu (ReLU)        (None, 56, 56, 48)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 56, 56, 96)        4608      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 56, 56, 96)        384       
_________________________________________________________________
conv_pw_2_relu (ReLU)        (None, 56, 56, 96)        0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 96)        864       
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 56, 56, 96)        384       
_________________________________________________________________
conv_dw_3_relu (ReLU)        (None, 56, 56, 96)        0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 56, 56, 96)        9216      
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 56, 56, 96)        384       
_________________________________________________________________
conv_pw_3_relu (ReLU)        (None, 56, 56, 96)        0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 58, 58, 96)        0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 96)        864       
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 28, 28, 96)        384       
_________________________________________________________________
conv_dw_4_relu (ReLU)        (None, 28, 28, 96)        0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 28, 28, 192)       18432     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 28, 28, 192)       768       
_________________________________________________________________
conv_pw_4_relu (ReLU)        (None, 28, 28, 192)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 192)       1728      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 28, 28, 192)       768       
_________________________________________________________________
conv_dw_5_relu (ReLU)        (None, 28, 28, 192)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 28, 28, 192)       36864     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 28, 28, 192)       768       
_________________________________________________________________
conv_pw_5_relu (ReLU)        (None, 28, 28, 192)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 30, 30, 192)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 192)       1728      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 14, 14, 192)       768       
_________________________________________________________________
conv_dw_6_relu (ReLU)        (None, 14, 14, 192)       0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 14, 14, 384)       73728     
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_pw_6_relu (ReLU)        (None, 14, 14, 384)       0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 384)       3456      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_dw_7_relu (ReLU)        (None, 14, 14, 384)       0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 14, 14, 384)       147456    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_pw_7_relu (ReLU)        (None, 14, 14, 384)       0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 384)       3456      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_dw_8_relu (ReLU)        (None, 14, 14, 384)       0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 14, 14, 384)       147456    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_pw_8_relu (ReLU)        (None, 14, 14, 384)       0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 384)       3456      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_dw_9_relu (ReLU)        (None, 14, 14, 384)       0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 14, 14, 384)       147456    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_pw_9_relu (ReLU)        (None, 14, 14, 384)       0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 384)       3456      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_dw_10_relu (ReLU)       (None, 14, 14, 384)       0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 14, 14, 384)       147456    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_pw_10_relu (ReLU)       (None, 14, 14, 384)       0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 384)       3456      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_dw_11_relu (ReLU)       (None, 14, 14, 384)       0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 14, 14, 384)       147456    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 14, 14, 384)       1536      
_________________________________________________________________
conv_pw_11_relu (ReLU)       (None, 14, 14, 384)       0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 16, 16, 384)       0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 384)         3456      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 7, 7, 384)         1536      
_________________________________________________________________
conv_dw_12_relu (ReLU)       (None, 7, 7, 384)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 7, 7, 768)         294912    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 7, 7, 768)         3072      
_________________________________________________________________
conv_pw_12_relu (ReLU)       (None, 7, 7, 768)         0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 768)         6912      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 7, 7, 768)         3072      
_________________________________________________________________
conv_dw_13_relu (ReLU)       (None, 7, 7, 768)         0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 7, 7, 768)         589824    
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 7, 7, 768)         3072      
_________________________________________________________________
conv_pw_13_relu (ReLU)       (None, 7, 7, 768)         0         
_________________________________________________________________
global_average_pooling2d (Gl (None, 768)               0         
_________________________________________________________________
dropout (Dropout)            (None, 768)               0         
_________________________________________________________________
dense (Dense)                (None, 6)                 4614      
=================================================================
Total params: 1,837,590
Trainable params: 1,821,174
Non-trainable params: 16,416
_________________________________________________________________
